MAX_LEN_EMAIL = 254
"""Ограничивает количество символов в поле email."""

MAX_LEN_USER_INFO = 32
"""Ограничивает количество символов в полях информации о пользователе."""

MAX_LEN_CATEGORY_NAME = 32
"""Ограничивает количество символов в поле названия Тега."""

MAX_LEN_PRODUCT_NAME = 32
"""Ограничивает количество символов в поле названия Ингредиента."""

MAX_LEN_MEASURMENT_UNIT = 64
"""Ограничивает количество символов в поле названия Меры веса."""

MAX_LEN_RECIPE_NAME = 256
"""Ограничивает количество символов в поле названия Рецепта."""

PAGE_SIZE = 6
"""Определяет количество объектов на странице."""

CURRENCY = [("USD", "USD"), ("EUR", "EUR"), ("RUB", "RUB"), ("SEK", "SEK"), ("NOK", "NOK")]
